---
type: RevitAPIPreDocEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# RevitAPIPreDocEventArgs

`Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Document | 2010 | `public Document Document { get ; }` |